Ran Plan for 2 projects:

1. dir: `.` workspace: `stage`
1. dir: `.` workspace: `prod`

### 1. dir: `.` workspace: `stage`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -w stage`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.nik.com/lock?id=nikolay480%252Fdiplom-IaaC%252F.%252Fstage)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -w stage`

---
### 2. dir: `.` workspace: `prod`
<details><summary>Show Output</summary>

```diff
data.yandex_vpc_network.network: Reading...
data.yandex_vpc_subnet.subnet-1: Reading...
data.yandex_iam_service_account.sa: Reading...
data.yandex_vpc_subnet.subnet-3: Reading...
data.yandex_vpc_subnet.subnet-2: Reading...
data.yandex_vpc_subnet.subnet-1: Read complete after 0s [id=e9b96du03j3n7tj7p3ql]
data.yandex_vpc_subnet.subnet-2: Read complete after 0s [id=e2l4svhvidaogaqmvdt7]
data.yandex_iam_service_account.sa: Read complete after 0s [id=ajejnjpjqg2uhvvrqtvk]
data.yandex_vpc_subnet.subnet-3: Read complete after 1s [id=b0cri7mjahep03rht6f5]
data.yandex_vpc_network.network: Read complete after 1s [id=enp55kkhdo2a17reolhg]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # yandex_compute_instance_group.control-plane will be created
+ resource "yandex_compute_instance_group" "control-plane" {
+       created_at          = (known after apply)
+       deletion_protection = false
+       folder_id           = "b1ga4u00jltahn3l6fp9"
+       id                  = (known after apply)
+       instances           = (known after apply)
+       name                = "k8s-control-plane"
+       service_account_id  = "ajejnjpjqg2uhvvrqtvk"
+       status              = (known after apply)

+       allocation_policy {
+           zones = [
+               "ru-central1-a",
+               "ru-central1-b",
+               "ru-central1-c",
            ]
        }

+       deploy_policy {
+           max_creating     = 0
+           max_deleting     = 0
+           max_expansion    = 0
+           max_unavailable  = 1
+           startup_duration = 0
+           strategy         = (known after apply)
        }

+       instance_template {
+           labels      = (known after apply)
+           metadata    = {
+               "user-data" = <<-EOT
                    #cloud-config
                    users:
                      - name: vm-user
                        groups: sudo
                        shell: /bin/bash
                        sudo: ['ALL=(ALL) NOPASSWD:ALL']
                        ssh-authorized-keys:
                          - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCjOqxotweTB+3h10/vLXG9eZiC123nkXcQi1cJRkBk1h9npd47JCavWnafUzbt34hE3WYaZXWlQPJbuY0hzUqXzHygxvOtF//mBUoEJgpHCTkPpKbxAFyNgoIHl4jEjhFzleJomrI52IuozJNQHDUI3zBLdpfI8tKwTQ8EdhItPmgxTi1dupprd4eJLPxyyEpkEr3TQIrnAy8DqvzvFQbR+JNZIHI/NktHe5P38L2LVWpzBDVuzWxWFPJwwSjJr8TcfMfXPtvUQcPq4TYLFLO8elo1FQuoFDwtLhlWqaEo9L5iDqM8cu25LQNr6FCUlhaqipatFQDepxdyaJg1sS1hzeTV9b3xMWQY1GkQtuEwpGUs7BeaHdtsa6wU9HGJWa9Xd61R2tDcKOa5NacEPPFn7jtNbaYS5iJfPglYkny1L5sPQ0SJ+V6y9uDa99RctlVgC5777NsyT2scJRYBUpQo/wQAMBYgOZGqBom+Me3qMX+Dq4e4ujJK/wLIcsxTj7c= nik@nik-Ubuntu
                EOT
            }
+           name        = "master-{instance.index}"
+           platform_id = "standard-v1"

+           boot_disk {
+               device_name = (known after apply)
+               mode        = "READ_WRITE"

+               initialize_params {
+                   image_id    = "fd81n0sfjm6d5nq6l05g"
+                   size        = 40
+                   snapshot_id = (known after apply)
+                   type        = "network-sdd"
                }
            }

+           network_interface {
+               ip_address   = (known after apply)
+               ipv4         = true
+               ipv6         = (known after apply)
+               ipv6_address = (known after apply)
+               nat          = true
+               network_id   = "enp55kkhdo2a17reolhg"
+               subnet_ids   = [
+                   "b0cri7mjahep03rht6f5",
+                   "e2l4svhvidaogaqmvdt7",
+                   "e9b96du03j3n7tj7p3ql",
                ]
            }

+           resources {
+               core_fraction = 100
+               cores         = 2
+               memory        = 4
            }
        }

+       scale_policy {
+           fixed_scale {
+               size = 3
            }
        }
    }

  # yandex_compute_instance_group.worker-nodes will be created
+ resource "yandex_compute_instance_group" "worker-nodes" {
+       created_at          = (known after apply)
+       deletion_protection = false
+       folder_id           = "b1ga4u00jltahn3l6fp9"
+       id                  = (known after apply)
+       instances           = (known after apply)
+       name                = "k8s-workers"
+       service_account_id  = "ajejnjpjqg2uhvvrqtvk"
+       status              = (known after apply)

+       allocation_policy {
+           zones = [
+               "ru-central1-a",
+               "ru-central1-b",
+               "ru-central1-c",
            ]
        }

+       deploy_policy {
+           max_creating     = 0
+           max_deleting     = 0
+           max_expansion    = 0
+           max_unavailable  = 1
+           startup_duration = 0
+           strategy         = (known after apply)
        }

+       instance_template {
+           labels      = (known after apply)
+           metadata    = {
+               "user-data" = <<-EOT
                    #cloud-config
                    users:
                      - name: vm-user
                        groups: sudo
                        shell: /bin/bash
                        sudo: ['ALL=(ALL) NOPASSWD:ALL']
                        ssh-authorized-keys:
                          - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCjOqxotweTB+3h10/vLXG9eZiC123nkXcQi1cJRkBk1h9npd47JCavWnafUzbt34hE3WYaZXWlQPJbuY0hzUqXzHygxvOtF//mBUoEJgpHCTkPpKbxAFyNgoIHl4jEjhFzleJomrI52IuozJNQHDUI3zBLdpfI8tKwTQ8EdhItPmgxTi1dupprd4eJLPxyyEpkEr3TQIrnAy8DqvzvFQbR+JNZIHI/NktHe5P38L2LVWpzBDVuzWxWFPJwwSjJr8TcfMfXPtvUQcPq4TYLFLO8elo1FQuoFDwtLhlWqaEo9L5iDqM8cu25LQNr6FCUlhaqipatFQDepxdyaJg1sS1hzeTV9b3xMWQY1GkQtuEwpGUs7BeaHdtsa6wU9HGJWa9Xd61R2tDcKOa5NacEPPFn7jtNbaYS5iJfPglYkny1L5sPQ0SJ+V6y9uDa99RctlVgC5777NsyT2scJRYBUpQo/wQAMBYgOZGqBom+Me3qMX+Dq4e4ujJK/wLIcsxTj7c= nik@nik-Ubuntu
                EOT
            }
+           name        = "worker-{instance.index}"
+           platform_id = "standard-v1"

+           boot_disk {
+               device_name = (known after apply)
+               mode        = "READ_WRITE"

+               initialize_params {
+                   image_id    = "fd81n0sfjm6d5nq6l05g"
+                   size        = 20
+                   snapshot_id = (known after apply)
+                   type        = "network-hdd"
                }
            }

+           network_interface {
+               ip_address   = (known after apply)
+               ipv4         = true
+               ipv6         = (known after apply)
+               ipv6_address = (known after apply)
+               nat          = true
+               network_id   = "enp55kkhdo2a17reolhg"
+               subnet_ids   = [
+                   "b0cri7mjahep03rht6f5",
+                   "e2l4svhvidaogaqmvdt7",
+                   "e9b96du03j3n7tj7p3ql",
                ]
            }

+           resources {
+               core_fraction = 100
+               cores         = 2
+               memory        = 2
            }
        }

+       scale_policy {
+           fixed_scale {
+               size = 4
            }
        }
    }

  # yandex_container_registry.dev-cr will be created
+ resource "yandex_container_registry" "dev-cr" {
+       created_at = (known after apply)
+       folder_id  = "b1ga4u00jltahn3l6fp9"
+       id         = (known after apply)
+       labels     = {
+           "my-label" = "dev"
        }
+       name       = "dev-cr"
+       status     = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ master_node_external_ips         = (known after apply)
+ master_node_internal_ips         = (known after apply)
+ worker_node_external_ips         = (known after apply)
+ worker_node_internal_ips         = (known after apply)
+ yandex_container_registry_dev_cr = (known after apply)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -w prod`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.nik.com/lock?id=nikolay480%252Fdiplom-IaaC%252F.%252Fprod)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -w prod`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`